string = input("Enter a string: ")
count = string.count("a")
print("Number of 'a's:", count)


#string = input("Введите строку: "): Эта строка предлагает пользователю ввести строку с помощью функции input(). Введенная строка сохраняется в переменной string.
#count = string.count("a"): В этой строке используется метод count() для переменной string для подсчета количества вхождений буквы "a" во введенной строке. Результат сохраняется в переменной count.
#print("Количество букв "а":", количество): После подсчета вхождений "a" в этой строке выводится сообщение вместе с подсчетом. Он отображает количество раз, когда буква "a" появляется во введенной строке.
#Итак, этот код берет предоставленную пользователем строку, подсчитывает, сколько раз в ней встречается буква "a", а затем выводит результат подсчета.